models={
    'Multilingual':{
        'model_names':{
            'IndicSBERT-STS':'l3cube-pune/indic-sentence-similarity-sbert',
            'IndicSBERT':'l3cube-pune/indic-sentence-bert-nli'
            },
        'examples':{
            'Monolingual- Marathi':{
                'source':"दिवाळी आपण मोठ्या उत्साहाने साजरी करतो",
                'targets':["दिवाळी आपण आनंदाने साजरी करतो","दिवाळी हा दिव्यांचा सण आहे",""]
            },
            'Monolingual- Hindi':{
                'source':"हम दीपावली उत्साह के साथ मनाते हैं",
                'targets':["हम दीपावली खुशियों से मनाते हैं","दिवाली रोशनी का त्योहार है",""]
            },
            'Monolingual- Gujarati':{
                'source':"અમે ઉત્સાહથી દિવાળી ઉજવીએ છીએ",
                'targets':["દિવાળી આપણે ખુશીઓથી ઉજવીએ છીએ","દિવાળી એ રોશનીનો તહેવાર છે",""]
            }, 
            'Cross-lingual 1':{
                'source':"आम्हाला भारतीय असल्याचा अभिमान आहे",
                'targets':["हमें भारतीय होने पर गर्व है","భారతీయులమైనందుకు గర్విస్తున్నాం","અમને ભારતીય હોવાનો ગર્વ છે"]
            }, 
            'Cross-lingual 2':{
                'source':"ਬਾਰਿਸ਼ ਤੋਂ ਬਾਅਦ ਬਗੀਚਾ ਸੁੰਦਰ ਦਿਖਾਈ ਦਿੰਦਾ ਹੈ",
                'targets':["മഴയ്ക്ക് ശേഷം പൂന്തോട്ടം മനോഹരമായി കാണപ്പെടുന്നു","ବର୍ଷା ପରେ ବଗିଚା ସୁନ୍ଦର ଦେଖାଯାଏ","बारिश के बाद बगीचा सुंदर दिखता है"]
            } 
        }
    },
    'Marathi':{
        'model_names':{
            'MahaSBERT-STS':'l3cube-pune/marathi-sentence-similarity-sbert',
            'MahaSBERT':'l3cube-pune/marathi-sentence-bert-nli'
            },
        'examples':{
            'Example 1':{
                'source':"शेतकऱ्यांचे डोळे आकाशाकडे लागले आहेत",
                'targets':["आता शेतकऱ्यांचे डोळे आभाळाकडे लागले आहेत","अन्नधान्य उत्पादनासाठी शेतकरी कष्ट करतात","शहरात कचऱ्याचे ढीग दिसतात"]
            },
            'Example 2':{
                'source':"घटनेची माहिती मिळताच पोलिसांचा ताफा तेथे पोहोचला",
                'targets':["पोलिसांना घटनेची माहिती मिळताच त्यांचे पथक घटनास्थळी पोहोचले","तेव्हा पोलिसांनी त्यांच्या तक्रारीची दखल घेतली नाही","दिवसाचा उत्तरार्ध कुटुंबासोबत मौजमजेत घालवाल"]
            },
            'Example 3':{
                'source':"पहिल्या पाच किलोमीटर अंतरासाठी पाच रुपये दर आकारण्यात येत आहे",
                'targets':["पाच रुपयांत पाच किमी प्रवास करा","दोन ठिकाणांमधले मोठे अंतर प्रवास करणे कंटाळवाणे आहे","नुकत्याच झालेल्या पावसामुळे हिरवळ दिसत आहे"]
            }  
        }
    },    
    'Hindi':{
        'model_names':{
            'HindSBERT-STS':'l3cube-pune/hindi-sentence-similarity-sbert',
            'HindSBERT':'l3cube-pune/hindi-sentence-bert-nli'
        },
        'examples':{
            'Example 1':{
                'source':"एक आदमी एक रस्सी पर चढ़ रहा है",
                'targets':["एक आदमी एक रस्सी पर चढ़ता है","एक आदमी एक दीवार पर चढ़ रहा है","एक आदमी बांसुरी बजाता है"]
            },
            'Example 2':{
                'source':"कुछ लोग गा रहे हैं",
                'targets':["लोगों का एक समूह गाता है","बिल्ली दूध पी रही है","दो आदमी लड़ रहे हैं"]
            },
            'Example 3':{
                'source':"फेडरर ने 7वां विंबलडन खिताब जीत लिया है",
                'targets':["फेडरर अपने करियर में कुल 20 ग्रैंडस्लैम खिताब जीत चुके है","फेडरर ने सितंबर में अपने निवृत्ति की घोषणा की","एक आदमी कुछ खाना पकाने का तेल एक बर्तन में डालता है"]
            }  
        } 
    },
    'Bengali':{
        'model_names':{
            'BengaliSBERT-STS':'l3cube-pune/bengali-sentence-similarity-sbert',
            'BengaliSBERT':'l3cube-pune/bengali-sentence-bert-nli'
        },
        'examples':{
            'Example 1':{
                'source':"লোকটি কুড়াল দিয়ে একটি গাছ কেটে ফেলল",
                'targets':["একজন লোক কুড়াল দিয়ে একটি গাছের নিচে চপ করে","একজন লোক গিটার বাজছে","একজন মহিলা ঘোড়ায় চড়ে"]
            },
            'Example 2':{
                'source':"একটি গোলাপী সাইকেল একটি বিল্ডিংয়ের সামনে রয়েছে",
                'targets':["কিছু ধ্বংসাবশেষের সামনে একটি সাইকেল","গোলাপী দুটি ছোট মেয়ে নাচছে","ভেড়া গাছের লাইনের সামনে মাঠে চারণ করছে"]
            },
            'Example 3':{
                'source':"আলোর গতি সসীম হওয়ার গতি আমাদের মহাবিশ্বের অন্যতম মৌলিক",
                'targets':["আলোর গতি কত?","আলোর গতি সসীম","আলো মহাবিশ্বের দ্রুততম জিনিস"]
            }  
        } 
    },
    'Telugu':{
        'model_names':{
            'TeluguSBERT-STS':'l3cube-pune/telugu-sentence-similarity-sbert',
            'TeluguSBERT':'l3cube-pune/telugu-sentence-bert-nli'
        },
        'examples':{
            'Example 1':{
                'source':"ఒక మహిళ ఉల్లిపాయను కత్తిస్తోంది",
                'targets':["ఒక స్త్రీ ఉల్లిపాయలు కోస్తోంది","ఒక స్త్రీ బంగాళాదుంపను తొక్కడం","ఒక పిల్లి ఇంటి చుట్టూ నడుస్తోంది"]
            },
            'Example 2':{
                'source':"పిల్లల బృందం జంపింగ్ పోటీని నిర్వహిస్తోంది",
                'targets':["పిల్లల గుంపు సరదాగా గడుపుతోంది","పిల్లలు పార్కులో ఆడుకోవడానికి ఇష్టపడతారు","ముగ్గురు అబ్బాయిలు నడుస్తున్నారు"]
            },
            'Example 3':{
                'source':"మీ రెండు ప్రశ్నలకు అవుననే సమాధానం వస్తుంది",
                'targets':["రెండు ప్రశ్నలకు అవుననే సమాధానం వస్తోంది","మేము మీ అన్ని ప్రశ్నలకు సమాధానమిచ్చాము","నేను ఈ ప్రశ్నకు సమాధానం ఇస్తాను"]
            }  
        } 
    },
    'Tamil':{
        'model_names':{
            'TamilSBERT-STS':'l3cube-pune/tamil-sentence-similarity-sbert',
            'TamilSBERT':'l3cube-pune/tamil-sentence-bert-nli'
        },
        'examples':{
            'Example 1':{
                'source':"மக்கள் குழு பாடுகிறது",
                'targets':["சிலர் பாடுகிறார்கள்","ஒரு இளைஞன் பியானோ பாடுகிறான்","மனிதன் ஒரு கடிதம் எழுதுகிறான்"]
            },
            'Example 2':{
                'source':"நாய் பொம்மையை குரைக்கிறது",
                'targets':["ஒரு நாய் ஒரு பொம்மையில் குரைக்கிறது","ஒரு பூனை பால் குடிக்கிறது","ஒரு நாய் ஒரு பந்தைத் துரத்துகிறது"]
            },
            'Example 3':{
                'source':"நான் முதல் முறையாக விமானத்தில் அமர்ந்தேன்",
                'targets':["அது எனது முதல் விமானப் பயணம்","முதல் முறையாக ரயிலில் அமர்ந்தேன்","புதிய இடங்களுக்கு பயணம் செய்வது எனக்கு மிகவும் பிடிக்கும்"]
            }  
        } 
    },
    'Gujarati':{
        'model_names':{
            'GujaratiSBERT-STS':'l3cube-pune/gujarati-sentence-similarity-sbert',
            'GujaratiSBERT':'l3cube-pune/gujarati-sentence-bert-nli'
        },
        'examples':{
            'Example 1':{
                'source':"એક માણસ દોરડા પર ચઢી રહ્યો છે",
                'targets':["એક માણસ દોરડા પર ચઢે છે","એક માણસ દિવાલ પર ચઢી રહ્યો છે","એક માણસ વાંસળી વગાડી રહ્યો છે"]
            },
            'Example 2':{
                'source':"કેટલાક લોકો ગાતા હોય છે",
                'targets':["લોકોનું એક જૂથ ગાય છે","એક બિલાડી દૂધ પી રહી છે","બે માણસો લડી રહ્યા છે"]
            },
            'Example 3':{
                'source':"હું પહેલીવાર વિમાનમાં બેઠો",
                'targets':["તે મારી પ્રથમ વિમાનની મુસાફરી હતી","હું પહેલીવાર ટ્રેનમાં બેઠો","મને નવી જગ્યાઓ પર ફરવાનું પસંદ છે"]
            }  
        } 
    },
    'Kannada':{
        'model_names':{
            'KannadaSBERT-STS':'l3cube-pune/kannada-sentence-similarity-sbert',
            'KannadaSBERT':'l3cube-pune/kannada-sentence-bert-nli'
        },
        'examples':{
            'Example 1':{
                'source':"ನಮ್ಮ ಪರಿಸರದ ಬಗ್ಗೆ ನಾವು ಕಾಳಜಿ ವಹಿಸಬೇಕು",
                'targets':["ನಮ್ಮ ಪರಿಸರವನ್ನು ಸ್ವಚ್ಛವಾಗಿಟ್ಟುಕೊಳ್ಳೋಣ","ಜಾಗತಿಕ ತಾಪಮಾನವು ಗಂಭೀರ ಸಮಸ್ಯೆಯಾಗಿದೆ","ಹೆಚ್ಚು ಮರಗಳನ್ನು ನೆಡಿ"]
            },
            'Example 2':{
                'source':"ಕೆಲವರು ಹಾಡುತ್ತಿದ್ದಾರೆ",
                'targets':["ಜನರ ಗುಂಪು ಹಾಡುತ್ತಿದೆ","ಬೆಕ್ಕು ಹಾಲು ಕುಡಿಯುತ್ತಿದೆ","ಇಬ್ಬರು ಪುರುಷರು ಜಗಳವಾಡುತ್ತಿದ್ದಾರೆ"]
            },
            'Example 3':{
                'source':"ಫೆಡರರ್ ವಿಂಬಲ್ಡನ್ ಪ್ರಶಸ್ತಿ ಗೆದ್ದಿದ್ದಾರೆ",
                'targets':["ಫೆಡರರ್ ತಮ್ಮ ವೃತ್ತಿಜೀವನದಲ್ಲಿ ಒಟ್ಟು 20 ಗ್ರ್ಯಾನ್ ಸ್ಲಾಮ್ ಪ್ರಶಸ್ತಿಗಳನ್ನು ಗೆದ್ದಿದ್ದಾರೆ","ಫೆಡರರ್ ಸೆಪ್ಟೆಂಬರ್‌ನಲ್ಲಿ ನಿವೃತ್ತಿ ಘೋಷಿಸಿದರು","ಒಬ್ಬ ಮನುಷ್ಯ ಒಂದು ಪಾತ್ರೆಯಲ್ಲಿ ಸ್ವಲ್ಪ ಅಡುಗೆ ಎಣ್ಣೆಯನ್ನು ಸುರಿಯುತ್ತಾನೆ"]
            }  
        } 
    },
    'Malayalam':{
        'model_names':{
            'MalayalamSBERT-STS':'l3cube-pune/malayalam-sentence-similarity-sbert',
            'MalayalamSBERT':'l3cube-pune/malayalam-sentence-bert-nli'
        },
        'examples':{
            'Example 1':{
                'source':"കുട്ടികൾ പാർക്കിൽ കളിക്കാൻ ഇഷ്ടപ്പെടുന്നു",
                'targets':["କେବଳ ପିଲାମାନଙ୍କୁ ପାର୍କରେ ଖେଳିବାକୁ ଅନୁମତି ଦିଆଯାଇଛି","പാർക്കിൽ കുട്ടികൾക്ക് മാത്രമേ കളിക്കാൻ അനുവാദമുള്ളൂ","കുട്ടികൾ പന്തുമായി കളിക്കാൻ ഇഷ്ടപ്പെടുന്നു"]
            },
            'Example 2':{
                'source':"പെയിന്റിംഗ് എന്റെ ഹോബിയാണ്",
                'targets':["നൃത്തം എന്റെ ഹോബിയാണ്","എനിക്ക് ധാരാളം ഹോബികൾ ഉണ്ട്","പെയിന്റിംഗും നൃത്തവും ഞാൻ ആസ്വദിക്കുന്നു"]
            },
            'Example 3':{
                'source':"2 മണിക്കൂറിനുള്ളിൽ നിങ്ങൾക്ക് നഗരത്തിലേക്ക് പോകാം",
                'targets':["2 മണിക്കൂർ കൊണ്ട് നഗരത്തിലെത്താം","യാത്രാ ദൈർഘ്യം 2 മണിക്കൂർ മാത്രം","പുതിയ സ്ഥലങ്ങളിലേക്കുള്ള യാത്ര എനിക്ക് ഇഷ്ടമാണ്"]
            }  
        } 
    },
    'Odia':{
        'model_names':{
            'OdiaSBERT-STS':'l3cube-pune/odia-sentence-similarity-sbert',
            'OdiyaSBERT':'l3cube-pune/odia-sentence-bert-nli'
        },
        'examples':{
            'Example 1':{
                'source':"লোকটি কুড়াল দিয়ে একটি গাছ কেটে ফেলল",
                'targets':["একজন লোক কুড়াল দিয়ে একটি গাছের নিচে চপ করে","একজন লোক গিটার বাজছে","একজন মহিলা ঘোড়ায় চড়ে"]
            },
            'Example 2':{
                'source':"একটি গোলাপী সাইকেল একটি বিল্ডিংয়ের সামনে রয়েছে",
                'targets':["কিছু ধ্বংসাবশেষের সামনে একটি সাইকেল","গোলাপী দুটি ছোট মেয়ে নাচছে","ভেড়া গাছের লাইনের সামনে মাঠে চারণ করছে"]
            },
            'Example 3':{
                'source':"আলোর গতি সসীম হওয়ার গতি আমাদের মহাবিশ্বের অন্যতম মৌলিক",
                'targets':["আলোর গতি কত?","আলোর গতি সসীম","আলো মহাবিশ্বের দ্রুততম জিনিস"]
            }  
        } 
    },
    'Punjabi':{
        'model_names':{
            'PunjabiSBERT-STS':'l3cube-pune/punjabi-sentence-similarity-sbert',
            'PunjabiSBERT':'l3cube-pune/punjabi-sentence-bert-nli'
        },
        'examples':{
            'Example 1':{
                'source':"ਪੇਂਟਿੰਗ ਮੇਰਾ ਸ਼ੌਕ ਹੈ",
                'targets':["ਨੱਚਣਾ ਮੇਰਾ ਸ਼ੌਕ ਹੈ","ਮੇਰੇ ਬਹੁਤ ਸਾਰੇ ਸ਼ੌਕ ਹਨ","ਮੈਨੂੰ ਪੇਂਟਿੰਗ ਅਤੇ ਡਾਂਸ ਦੋਵਾਂ ਦਾ ਆਨੰਦ ਆਉਂਦਾ ਹੈ"]
            },
            'Example 2':{
                'source':"ਕੁਝ ਲੋਕ ਗਾ ਰਹੇ ਹਨ",
                'targets':["ਲੋਕਾਂ ਦਾ ਇੱਕ ਸਮੂਹ ਗਾ ਰਿਹਾ ਹੈ","ਇੱਕ ਬਿੱਲੀ ਦੁੱਧ ਪੀ ਰਹੀ ਹੈ","ਦੋ ਆਦਮੀ ਲੜ ਰਹੇ ਹਨ"]
            },
            'Example 3':{
                'source':"ਮੇਰੇ ਘਰ ਵਿੱਚ ਤੁਹਾਡਾ ਸੁਆਗਤ ਹੈ",
                'targets':["ਮੈਂ ਤੁਹਾਡੇ ਘਰ ਵਿੱਚ ਤੁਹਾਡਾ ਸੁਆਗਤ ਕਰਾਂਗਾ","ਮੇਰਾ ਘਰ ਕਾਫੀ ਵੱਡਾ ਹੈ","ਅੱਜ ਮੇਰੇ ਘਰ ਵਿੱਚ ਰਹੋ"]
            }  
        } 
    },

}